
# (10+5), (10-5)
print("10+5=%d, 10-5=%d" %(10+5, 10-5))
#년도 : 2026년, 해당월 : 8월
print("년도 : %d 년 해당월 : %d 월" % (2026, 8))
# 타입별 출력방법, 매우중요함(꼭 외울것)******

# print ("%d" % 1) # %d : 정수
# print ("%f" % 1.5)  # %f : 실수
# print ("%s" % % "안녕")  # %s : 문자입력
# print("%d" % 1.5)  # %f
# print("%f" % 1)    # 정수, 실수 --> 숫자형 1.0 = 1 서로 같지 안다.
# print("%d" % "안녕")   #숫자열에 문자열을 넣으면 에러
# print("%s" % 1)     # 문자타입에 숫자넣으면 OK
# print("%s" % 1.5)     # 문자타입에 실수를 넣으면 OK
# print("결과값 :" 5)
# print("결과값 :" 1+4)   # 이것은 에러
# print("결과값 : %d" % 2+3)  # 문자와 같이 쓰려면 이 형식을 따른다.

# *******

# 주석 : #을 붙이면 됨. 주석은 설명문임. 줄 선택 후 ctrl + /는 모두 설명문으로 바꿈
# print ; 출력명령문
# print("안녕하세요")
# print(1+1)   # 수식을 계산함
# print("1+1")   # 있는 그대로 출력함
# print(안녕)     # 문자는 항상 ""를 넣어야 함.
# print("결과값 :" +1+1)   # 문자, 숫자를 함께 출력이 안됨
# print("결과값 : %d" % (1+1))  # %를 이용하여 문자와 숫자를 함께 출력함
# print("결과값 : %d %d" % (100 200))  # %를 이용하여 문자와 숫자를 함께 출력함

