# 10+3,10-3,10*3,10/3
# {:.2f}는 소수점 2자리까진 출력하라는 표현
print("덧셈:{},뺄샘:{},곱셈:{},나눗셈:{:.2f}".format(10+3,10-3,10*3,10/3))
print("덧셈:{},뺄샘:{},곱셈:{},나눗셈:{:10.2f}".format(10+3,10-3,0*3,10/3))  # 총 자리수가 10자리로 출력
print("덧셈:{},뺄샘:{},곱셈:{},나눗셈:{:010.2f}".format(10+3,10-3,10*3,10/3))   # 앞에 "0"을넣으면 공란을 "0"으로 채워줌
print("번호 : 011")
print("{:07d}".format(10))
print("{:07d}".format(1234567))
print("{:7d}".format(10))

# 20*3, 20/3 나눗셈은 소수점 1자리까지 출력
print("곱셈:{:d}, 나눗셈:{:.1f}".format(20*3, 20/3))
print("곱셈:{:010d}, 나눗셈:{:010.1f}".format(20*3, 20/3))


# print("결과값 : %d" % 10)
# print("결과값 : %d, 결과값 : %d" % (10+5, 10-5))
# print("해당년도:%d, 해당월:%d월" %(2026, 8))

# 문자와 숫자를 함께출력할때 안되는데, format, %출력을 하면 함께 출력이 됨

# print("결과값 : {:d}, 소수점 : {:f}".format(10, 5.123))

# print("더하기 : {}".format(10+5))

