# if 조건:(참이면 동작) else:(거짓이면 동작)
# a = 99
# if a<100:
#     print("100보다 작은수입니다.")
# else:
#     print("100보다 큰수입니다.")
#     print("종료")

# a = int(input("숫자입력 : "))  # 문자 10과 숫자 10은 다름

# if a>100:
#     print("100보다 큰수")      # 조건이후의 내용은 줄띄움 없이 들여쓰기를 같게 한다.
# else:
#     print("100보다 직은수")
# print("입력한 숫자",a)

# a, b를 입력받아
# 합게가 100이 넘으면 100보다 큰수, 100보다 작은수라고 출력하시오
# 1. 숫자입력
# 2. 합계
# 3. 조건

# a = int(input("첫번째 값을 입력하세요>> "))
# b = int(input("두번째 값을 입력하세요>> "))
# t = (a+b)
# if t>100:
#     print("합계가 100보다 큽니다.")
# else:
#     print("합계가 100보다 작습니다.")
# print("입력한 수 : {},{} / 합계 : {}".format(a,b,t))

