# 구구단을 출력 아래로

# 구구단을 가로로

# 구구단을 단별로 가로로

# 구구단을 시작과 끝을 입력받아 실행

# 구구단을 입력받은 단만 출력

# 구구단을 입력단의 입력 수자까지만 실행

# 리스트 변수에 입력받은 수, 문자를 넣으려면

# 3명의 학생 성적을 입력받아
# [학생성적]
# 홍길동 70
# 유관순 100
# 이순신 90 으로 출력하시오

# 리스트["딸기","수박","사과"]를 받아
# 1.딸기 / 2.수박 / 3.사과형식으로 출력하시오.

# 두 수를 립력받아 합을 구하는 무한반복 프로그램을 구현하시오.

# 1~100까지 랜덤숫자 1래를 생성

# 랜덤 숫자 : [1,5,9,7,4,]
# 입력한 숫자 : 1
# 입력한 숫자가 랜덤숫자와 몇개가 맞는지 갯수를 출력하시오.

# 읿력한 숫자 모두 저장
# 1. 입력한 숫자 리스트에 저장
# 3. 반복문 종료시, 입력된 숫자 모두 출력

# 랜덤으로 1-45중 6개추출(중복없이)
# 입력숫자 6개 받음(중복 확인)
# 랜덤과 비교
# 맞은갯수 :
# 맞춘번호 :
# 당첨등수 확인 :

# 1~100사이의 랜덤번호를 맞추는 프로그램을 구현하시오
# 랜덤번호 보다 입력값이 높으면 낮은수를 입려하시오!, 낮으면 높은수를 입력하시오!
# 정답을 맞추면
# 정답숫자 :
# 숫자입력 횟수 :
# 입력한 숫자 :

# 로또맞추기 프로그램 구현